{
  "info": {
    "email": "shawnycx@gmail.com",
    "resume_download_url": "/assets/resume.pdf"
  },
  "summary": "Results-driven Software Engineer with 7+ years of experience delivering high-impact solutions across fast-paced, customer-focused environments. Specializes in building scalable platforms, optimizing system performance, and leading cross-functional initiatives that enhance both developer and user experiences. Adept at collaborating with stakeholders, and architecting solutions that align technical excellence with business goals. Passionate about engineering quality, operational efficiency, and continuous innovation.",
  "experiences": [
    {
      "company_name": "BigCommerce",
      "company_url": "https://www.bigcommerce.com/",
      "role": "Software Engineer",
      "start_date": "June, 2021",
      "end_date": "",
      "location": "Austin [TX]",
      "responsibilities": [
        "Led the migration of a core service used by both internal and external developers, delivering improvements to usability, 25% overall performance improvements, and scalability.",
        "Contributed to internal open source libraries, shaping design consistency and improving the developer experience acrossmultiple teams.",
        "Collaborated closely with software engineering leads to refine architecture and address complex system challenges, resulting in a 70% infrastructure cost savings and major performance improvements across both frontend and backend systems.",
        "Supported public-facing product demos and initiatives, helping showcase developer product enhancements at company-wide events and external conferences"
      ]
    },
    {
      "company_name": "Texas Realtors",
      "company_url": "https://www.texasrealestate.com/",
      "role": "Software Engineer",
      "start_date": "May, 2017",
      "end_date": "May, 2021",
      "location": "Austin [TX]",
      "responsibilities": [
        "Led the modernization initiative to migrate core applications from a monolithic ColdFusion stack to a React and microservice stack, dramatically improving service maintainability, user experience and overall application performance by more than 2x.",
        "Collaborated with backend and DevOps teams to build scalable CI/CD pipelines on AWS, improving deployment reliability, reducing manual overhead, and accelerating release cycles across multiple applications.",
        "Implemented throttling, rate-limiting, and load balancing strategies using AWS to safeguard backend services, improve system reliability, and ensure efficient resource utilization under high-traffic conditions. system reliability, and ensure efficient resource utilization under high-traffic conditions."
      ]
    },
    {
      "company_name": "M800 Limited",
      "company_url": "https://www.m800.com/",
      "role": "iOS Developer",
      "start_date": "May, 2016",
      "end_date": "Aug, 2016",
      "location": "[Hong Kong]",
      "responsibilities": [
        "Contributed to cross-team efforts to refactor and migrate legacy modules, ensuring zero-downtime rollouts and improved code maintainability.",
        "Collaborated with QA and release teams to deliver high-quality mobile features within tight deadlines."
      ]
    },
    {
      "company_name": "Accenture",
      "company_url": "https://www.accenture.com/",
      "role": "Software Engineer",
      "start_date": "May, 2015",
      "end_date": "Aug, 2015",
      "location": "Kuala Lumpur [Malaysia]",
      "responsibilities": [
        "Optimized data preprocessing workflows for high-volume imports by refactoring ETL scripts, boosting throughput and system reliability.",
        "Conducted extensive UAT and manual testing for a PostgreSQL and Siebel-powered e-commerce system, ensuring data integrity and client satisfaction."
      ]
    }
  ],
  "skills": [
    "Javascript",
    "Typescript",
    "React.js",
    "Next.js",
    "Node.js",
    "AWS",
    "Git",
    "GitHub",
    "Redis",
    "CI/CD",
    "MySQL",
    "PostgreSQL"
  ],
  "educations": [
    {
      "school": "Abilene Christian University",
      "degree": "Bachelor of Science (BS)",
      "major": "Computer Science",
      "graduation_year": "2017",
      "university_url": "https://www.acu.edu/",
      "location": "Abilene [TX]"
    }
  ]
}